---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ConnectionInputPointInfo Constructor
ConnectionInputPointInfo Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionInputPointInfo()()()() | Construct a default input point. |
|  | ConnectionInputPointInfo(String, Int32, String) | Construct an input point info. |

# See Also

ConnectionInputPointInfo Class

ConnectionInputPointInfo Members

Autodesk.Revit.DB.Structure Namespace